import pandas as pd
import pytest


@pytest.fixture
def mock_df_data():
    """Фикстура с тестовыми данными DataFrame"""
    return pd.DataFrame({
        "Сумма платежа": [-1000, -2000, 3000, -500],
        "Статус": ["OK", "OK", "OK", "FAILED"],
        "Категория": ["Супермаркеты", "Транспорт", "Каршеринг", "Переводы"],
        "Дата платежа": ["2023-01-01", "2023-02-15", "2023-03-01", "2023-01-20"],
        "Номер карты": ["1234", "5678", "1234", "5678"],
        "Описание": ["Магнит", "Такси", "Яндекс-Драйв", "Олег"]
    })


@pytest.fixture
def mock_dict_data():
    """Фикстура с тестовыми данными Dict"""
    return [{'Дата платежа': '2023-01-01',
             'Категория': 'Супермаркеты',
             'Номер карты': '1234',
             'Описание': 'Магнит',
             'Статус': 'OK',
             'Сумма платежа': -1000},
            {'Дата платежа': '2023-02-15',
             'Категория': 'Транспорт',
             'Номер карты': '5678',
             'Описание': 'Такси',
             'Статус': 'OK',
             'Сумма платежа': -2000},
            {'Дата платежа': '2023-03-01',
             'Категория': 'Каршеринг',
             'Номер карты': '1234',
             'Описание': 'Яндекс-Драйв',
             'Статус': 'OK',
             'Сумма платежа': 3000},
            {'Дата платежа': '2023-01-20',
             'Категория': 'Переводы',
             'Номер карты': '5678',
             'Описание': 'Олег',
             'Статус': 'FAILED',
             'Сумма платежа': -500}]